rubencardoza/DIPLOMADO_PROYECTO_FINAL_IOT/PROYECYO_FINAL_IoT__K32L2B31A_Project/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*! @name PORTB0 (number 35), J4[2]/A0/LCD_P0
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_GPIOB0_FGPIO FGPIOB             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_GPIOB0_GPIO GPIOB               /*!<@brief GPIO peripheral base pointer */
#define BOARD_GPIOB0_GPIO_PIN_MASK (1U << 0U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_GPIOB0_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_GPIOB0_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_GPIOB0_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PORTB1 (number 36), J4[4]/A1/LCD_P1
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_GPIOB1_FGPIO FGPIOB             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_GPIOB1_GPIO GPIOB               /*!<@brief GPIO peripheral base pointer */
#define BOARD_GPIOB1_GPIO_PIN_MASK (1U << 1U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_GPIOB1_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_GPIOB1_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_GPIOB1_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PORTB2 (number 37), J4[6]/A2/LCD_P2
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_GPIOB2_FGPIO FGPIOB             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_GPIOB2_GPIO GPIOB               /*!<@brief GPIO peripheral base pointer */
#define BOARD_GPIOB2_GPIO_PIN_MASK (1U << 2U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_GPIOB2_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_GPIOB2_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_GPIOB2_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PORTB3 (number 38), J4[8]/A3/LCD_P3
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_GPIOB3_FGPIO FGPIOB             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_GPIOB3_GPIO GPIOB               /*!<@brief GPIO peripheral base pointer */
#define BOARD_GPIOB3_GPIO_PIN_MASK (1U << 3U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_GPIOB3_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_GPIOB3_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_GPIOB3_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

/*! @name PORTB18 (number 41), J1[1]/LCD_P14
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD_P14_PORT PORTB                /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_P14_PIN 18U                   /*!<@brief PORT pin number */
#define BOARD_LCD_P14_PIN_MASK (1U << 18U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*! @name PORTB19 (number 42), J1[3]/LCD_P15
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD_P15_PORT PORTB                /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_P15_PIN 19U                   /*!<@brief PORT pin number */
#define BOARD_LCD_P15_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*! @name PORTC0 (number 43), J1[5]/LCD_P20/USB_SOF_OUT
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD_P20_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_P20_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_LCD_P20_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORTC4 (number 53), J1[7]/LCD_P24
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD_P24_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_P24_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_LCD_P24_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORTC6 (number 55), J1[9]/LCD_P26
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD_P26_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_P26_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_LCD_P26_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORTC7 (number 56), J1[11]/USB_SOF_OUT/LCD_P27
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD_P27_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_P27_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_LCD_P27_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                               /* @} */

